In [6]:
import pandas as pd

df = pd.read_csv('data_science_job - data_science_job.csv')

In [7]:
df.shape

(19158, 13)

In [8]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0

In [9]:
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [10]:
df.tail()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [11]:
df.describe()

,enrollee_id,city_development_index,experience,training_hours,target
count,19158.000000,18679.000000,19093.000000,18392.000000,19158.000000
mean,16875.358179,0.828951,9.928036,65.185787,0.249348
std,9616.292592,0.123334,6.505268,59.885626,0.432647
min,1.000000,0.448000,0.000000,1.000000,0.000000
25%,8554.250000,0.740000,4.000000,23.000000,0.000000
50%,16982.500000,0.903000,9.000000,47.000000,0.000000
75%,25169.750000,0.920000,16.000000,88.000000,0.000000
max,33380.000000,0.949000,20.000000,336.000000,1.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  18679 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  float64
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  training_hours          18392 non-null  float64
 12  target                  19158 non-null  int64
dtypes: float64(3), int64(2), object(8)
memory usage: 1.9+ MB

In [13]:
df.isnull()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,False,False,False,False,False,False,False,False,False,True,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False,False,True,True,False,False
3,False,False,False,True,False,True,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,False,False,False,False,False,False,False,False,False,True,True,False,False
19154,False,False,False,False,False,False,False,False,False,True,True,False,False
19155,False,False,False,False,False,False,False,False,False,False,False,False,False
19156,False,False,False,False,False,False,False,True,False,False,False,False,False
19157,False,False,False,True,False,False,False,True,False,True,True,False,False

In [14]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

In [15]:
df[100:200]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
100,6172,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,8.0,100-500,Pvt Ltd,24.0,1
101,14672,city_173,0.878,NaN,No relevent experience,no_enrollment,Masters,STEM,20.0,NaN,NaN,150.0,0
102,18257,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,11.0,500-999,NGO,20.0,0
103,24493,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,5.0,500-999,NaN,NaN,0
104,1180,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,12.0,5000-9999,Pvt Ltd,52.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,9890,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Humanities,14.0,<10,Early Stage Startup,178.0,0
196,32683,city_160,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,11.0,0
197,27104,city_36,0.893,Male,Has relevent experience,no_enrollment,High School,NaN,20.0,NaN,NaN,87.0,0
198,7731,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,NaN,NaN,84.0,0
199,31943,city_71,0.884,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,100-500,Early Stage Startup,32.0,0

In [16]:
df1 = df[100:200]

In [17]:
df1

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
100,6172,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,8.0,100-500,Pvt Ltd,24.0,1
101,14672,city_173,0.878,NaN,No relevent experience,no_enrollment,Masters,STEM,20.0,NaN,NaN,150.0,0
102,18257,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,11.0,500-999,NGO,20.0,0
103,24493,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,5.0,500-999,NaN,NaN,0
104,1180,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,12.0,5000-9999,Pvt Ltd,52.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,9890,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Humanities,14.0,<10,Early Stage Startup,178.0,0
196,32683,city_160,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,11.0,0
197,27104,city_36,0.893,Male,Has relevent experience,no_enrollment,High School,NaN,20.0,NaN,NaN,87.0,0
198,7731,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,NaN,NaN,84.0,0
199,31943,city_71,0.884,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,100-500,Early Stage Startup,32.0,0

## Creating Dataset

In [18]:
country = ['India', 'France', 'Germany', 'France', 'Germany', 'India', 'Germany', 'France', 'India', 'France']

In [19]:
len(country)

10

In [20]:
age = [22, 29, 35, 26, 41, 24, 38, 31, 27, 34]

salary = [50000, 70000, 85000, 65000, 90000, 52000, 88000, 72000, 58000, 75000]

experience = [0, 5, 10, 3, 15, 1, 12, 7, 2, 8]

In [21]:
len(age)

10

In [28]:
len(salary)

10

In [29]:
df = pd.DataFrame({
    'Country': country,
    'Age': age,
    'Salary': salary,
    'Experience': experience
})